; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob26) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate13)
	(at pallet1 depot1)
	(clear crate12)
	(at pallet2 depot2)
	(clear crate5)
	(at pallet3 distributor0)
	(clear crate6)
	(at pallet4 distributor1)
	(clear crate10)
	(at pallet5 distributor2)
	(clear crate2)
	(at pallet6 distributor1)
	(clear pallet6)
	(at pallet7 distributor0)
	(clear crate7)
	(at pallet8 depot0)
	(clear crate14)
	(at pallet9 distributor2)
	(clear crate9)
	(at truck0 distributor2)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 depot2)
	(available hoist10)
	(at hoist11 distributor2)
	(available hoist11)
	(at hoist12 distributor0)
	(available hoist12)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(at crate1 distributor1)
	(on crate1 pallet4)
	(at crate2 distributor2)
	(on crate2 crate0)
	(at crate3 depot0)
	(on crate3 pallet8)
	(at crate4 depot0)
	(on crate4 pallet0)
	(at crate5 depot2)
	(on crate5 pallet2)
	(at crate6 distributor0)
	(on crate6 pallet3)
	(at crate7 distributor0)
	(on crate7 pallet7)
	(at crate8 distributor2)
	(on crate8 pallet9)
	(at crate9 distributor2)
	(on crate9 crate8)
	(at crate10 distributor1)
	(on crate10 crate1)
	(at crate11 depot0)
	(on crate11 crate4)
	(at crate12 depot1)
	(on crate12 pallet1)
	(at crate13 depot0)
	(on crate13 crate11)
	(at crate14 depot0)
	(on crate14 crate3)
)

(:goal (and
		(on crate0 crate10)
		(on crate1 crate6)
		(on crate2 crate5)
		(on crate3 pallet8)
		(on crate4 pallet2)
		(on crate5 pallet5)
		(on crate6 crate8)
		(on crate8 crate14)
		(on crate9 crate4)
		(on crate10 pallet7)
		(on crate12 pallet1)
		(on crate13 pallet9)
		(on crate14 pallet3)
	)
))

; plan
1. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 2 of 13
2. (lift hoist7 crate13 crate11 depot0)
   deleted: (at crate13 depot0) (clear crate13) (available hoist7) (on crate13 crate11)
   added: (lifting hoist7 crate13) (clear crate11)
   goals met: 2 of 13
3. (load hoist7 crate13 truck1 depot0)
   deleted: (lifting hoist7 crate13)
   added: (in crate13 truck1) (available hoist7)
   goals met: 2 of 13
4. (lift hoist0 crate11 crate4 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate4)
   added: (lifting hoist0 crate11) (clear crate4)
   goals met: 2 of 13
5. (lift hoist8 crate2 crate0 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist8) (on crate2 crate0)
   added: (lifting hoist8 crate2) (clear crate0)
   goals met: 2 of 13
6. (load hoist8 crate2 truck0 distributor2)
   deleted: (lifting hoist8 crate2)
   added: (in crate2 truck0) (available hoist8)
   goals met: 2 of 13
7. (lift hoist8 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist8) (on crate0 pallet5)
   added: (lifting hoist8 crate0) (clear pallet5)
   goals met: 2 of 13
8. (load hoist8 crate0 truck0 distributor2)
   deleted: (lifting hoist8 crate0)
   added: (in crate0 truck0) (available hoist8)
   goals met: 2 of 13
9. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 2 of 13
10. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 2 of 13
11. (unload hoist8 crate13 truck1 distributor2)
   deleted: (in crate13 truck1) (available hoist8)
   added: (lifting hoist8 crate13)
   goals met: 2 of 13
12. (unload hoist9 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist9)
   added: (lifting hoist9 crate0)
   goals met: 2 of 13
13. (lift hoist5 crate9 crate8 distributor2)
   deleted: (at crate9 distributor2) (clear crate9) (available hoist5) (on crate9 crate8)
   added: (lifting hoist5 crate9) (clear crate8)
   goals met: 2 of 13
14. (load hoist5 crate9 truck1 distributor2)
   deleted: (lifting hoist5 crate9)
   added: (in crate9 truck1) (available hoist5)
   goals met: 2 of 13
15. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 2 of 13
16. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 2 of 13
17. (unload hoist6 crate2 truck0 depot2)
   deleted: (in crate2 truck0) (available hoist6)
   added: (lifting hoist6 crate2)
   goals met: 2 of 13
18. (lift hoist5 crate8 pallet9 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 pallet9)
   added: (lifting hoist5 crate8) (clear pallet9)
   goals met: 2 of 13
19. (drop hoist8 crate13 pallet9 distributor2)
   deleted: (lifting hoist8 crate13) (clear pallet9)
   added: (available hoist8) (at crate13 distributor2) (clear crate13) (on crate13 pallet9)
   goals met: 3 of 13
20. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 3 of 13
21. (load hoist5 crate8 truck1 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck1) (available hoist5)
   goals met: 3 of 13
22. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 3 of 13
23. (lift hoist4 crate10 crate1 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate1)
   added: (lifting hoist4 crate10) (clear crate1)
   goals met: 3 of 13
24. (drop hoist4 crate10 pallet6 distributor1)
   deleted: (lifting hoist4 crate10) (clear pallet6)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 pallet6)
   goals met: 3 of 13
25. (lift hoist4 crate1 pallet4 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet4)
   added: (lifting hoist4 crate1) (clear pallet4)
   goals met: 3 of 13
26. (drop hoist9 crate0 crate10 distributor1)
   deleted: (lifting hoist9 crate0) (clear crate10)
   added: (available hoist9) (at crate0 distributor1) (clear crate0) (on crate0 crate10)
   goals met: 4 of 13
27. (lift hoist2 crate5 pallet2 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist2) (on crate5 pallet2)
   added: (lifting hoist2 crate5) (clear pallet2)
   goals met: 4 of 13
28. (load hoist2 crate5 truck0 depot2)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   goals met: 4 of 13
29. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 4 of 13
30. (unload hoist8 crate5 truck0 distributor2)
   deleted: (in crate5 truck0) (available hoist8)
   added: (lifting hoist8 crate5)
   goals met: 4 of 13
31. (drop hoist8 crate5 pallet5 distributor2)
   deleted: (lifting hoist8 crate5) (clear pallet5)
   added: (available hoist8) (at crate5 distributor2) (clear crate5) (on crate5 pallet5)
   goals met: 5 of 13
32. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 5 of 13
33. (load hoist4 crate1 truck1 distributor1)
   deleted: (lifting hoist4 crate1)
   added: (in crate1 truck1) (available hoist4)
   goals met: 5 of 13
34. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 5 of 13
35. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 5 of 13
36. (unload hoist3 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist3)
   added: (lifting hoist3 crate1)
   goals met: 5 of 13
37. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 5 of 13
38. (unload hoist7 crate8 truck1 depot0)
   deleted: (in crate8 truck1) (available hoist7)
   added: (lifting hoist7 crate8)
   goals met: 5 of 13
39. (drop hoist7 crate8 crate14 depot0)
   deleted: (lifting hoist7 crate8) (clear crate14)
   added: (available hoist7) (at crate8 depot0) (clear crate8) (on crate8 crate14)
   goals met: 6 of 13
40. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 6 of 13
41. (load hoist6 crate2 truck1 depot2)
   deleted: (lifting hoist6 crate2)
   added: (in crate2 truck1) (available hoist6)
   goals met: 6 of 13
42. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 6 of 13
43. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 6 of 13
44. (unload hoist8 crate2 truck1 distributor2)
   deleted: (in crate2 truck1) (available hoist8)
   added: (lifting hoist8 crate2)
   goals met: 6 of 13
45. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 6 of 13
46. (drop hoist8 crate2 crate5 distributor2)
   deleted: (lifting hoist8 crate2) (clear crate5)
   added: (available hoist8) (at crate2 distributor2) (clear crate2) (on crate2 crate5)
   goals met: 7 of 13
47. (unload hoist7 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist7)
   added: (lifting hoist7 crate9)
   goals met: 7 of 13
48. (load hoist0 crate11 truck1 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck1) (available hoist0)
   goals met: 7 of 13
49. (drop hoist7 crate9 crate4 depot0)
   deleted: (lifting hoist7 crate9) (clear crate4)
   added: (available hoist7) (at crate9 depot0) (clear crate9) (on crate9 crate4)
   goals met: 8 of 13
50. (lift hoist12 crate6 pallet3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist12) (on crate6 pallet3)
   added: (lifting hoist12 crate6) (clear pallet3)
   goals met: 8 of 13
51. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 8 of 13
52. (load hoist12 crate6 truck0 distributor0)
   deleted: (lifting hoist12 crate6)
   added: (in crate6 truck0) (available hoist12)
   goals met: 8 of 13
53. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 8 of 13
54. (unload hoist7 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist7)
   added: (lifting hoist7 crate6)
   goals met: 8 of 13
55. (drop hoist7 crate6 crate8 depot0)
   deleted: (lifting hoist7 crate6) (clear crate8)
   added: (available hoist7) (at crate6 depot0) (clear crate6) (on crate6 crate8)
   goals met: 9 of 13
56. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 9 of 13
57. (load hoist3 crate1 truck1 distributor0)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck1) (available hoist3)
   goals met: 9 of 13
58. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 9 of 13
59. (unload hoist7 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist7)
   added: (lifting hoist7 crate1)
   goals met: 9 of 13
60. (lift hoist4 crate0 crate10 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 crate10)
   added: (lifting hoist4 crate0) (clear crate10)
   goals met: 8 of 13
61. (lift hoist9 crate10 pallet6 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist9) (on crate10 pallet6)
   added: (lifting hoist9 crate10) (clear pallet6)
   goals met: 8 of 13
62. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 8 of 13
63. (load hoist9 crate10 truck1 distributor1)
   deleted: (lifting hoist9 crate10)
   added: (in crate10 truck1) (available hoist9)
   goals met: 8 of 13
64. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 8 of 13
65. (unload hoist3 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist3)
   added: (lifting hoist3 crate10)
   goals met: 8 of 13
66. (lift hoist12 crate7 pallet7 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist12) (on crate7 pallet7)
   added: (lifting hoist12 crate7) (clear pallet7)
   goals met: 8 of 13
67. (drop hoist3 crate10 pallet7 distributor0)
   deleted: (lifting hoist3 crate10) (clear pallet7)
   added: (available hoist3) (at crate10 distributor0) (clear crate10) (on crate10 pallet7)
   goals met: 9 of 13
68. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 9 of 13
69. (load hoist4 crate0 truck1 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck1) (available hoist4)
   goals met: 9 of 13
70. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 9 of 13
71. (unload hoist3 crate0 truck1 distributor0)
   deleted: (in crate0 truck1) (available hoist3)
   added: (lifting hoist3 crate0)
   goals met: 9 of 13
72. (drop hoist3 crate0 crate10 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate10)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate10)
   goals met: 10 of 13
73. (drop hoist7 crate1 crate6 depot0)
   deleted: (lifting hoist7 crate1) (clear crate6)
   added: (available hoist7) (at crate1 depot0) (clear crate1) (on crate1 crate6)
   goals met: 11 of 13
74. (lift hoist0 crate1 crate6 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate6)
   added: (lifting hoist0 crate1) (clear crate6)
   goals met: 10 of 13
75. (lift hoist7 crate9 crate4 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist7) (on crate9 crate4)
   added: (lifting hoist7 crate9) (clear crate4)
   goals met: 9 of 13
76. (load hoist7 crate9 truck0 depot0)
   deleted: (lifting hoist7 crate9)
   added: (in crate9 truck0) (available hoist7)
   goals met: 9 of 13
77. (drop hoist0 crate1 crate6 depot0)
   deleted: (lifting hoist0 crate1) (clear crate6)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate6)
   goals met: 10 of 13
78. (lift hoist7 crate4 pallet0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist7) (on crate4 pallet0)
   added: (lifting hoist7 crate4) (clear pallet0)
   goals met: 10 of 13
79. (load hoist7 crate4 truck0 depot0)
   deleted: (lifting hoist7 crate4)
   added: (in crate4 truck0) (available hoist7)
   goals met: 10 of 13
80. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 10 of 13
81. (unload hoist6 crate4 truck0 depot2)
   deleted: (in crate4 truck0) (available hoist6)
   added: (lifting hoist6 crate4)
   goals met: 10 of 13
82. (unload hoist2 crate9 truck0 depot2)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   goals met: 10 of 13
83. (drop hoist6 crate4 pallet2 depot2)
   deleted: (lifting hoist6 crate4) (clear pallet2)
   added: (available hoist6) (at crate4 depot2) (clear crate4) (on crate4 pallet2)
   goals met: 11 of 13
84. (drop hoist2 crate9 crate4 depot2)
   deleted: (lifting hoist2 crate9) (clear crate4)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 crate4)
   goals met: 12 of 13
85. (lift hoist0 crate1 crate6 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate6)
   added: (lifting hoist0 crate1) (clear crate6)
   goals met: 11 of 13
86. (lift hoist7 crate6 crate8 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist7) (on crate6 crate8)
   added: (lifting hoist7 crate6) (clear crate8)
   goals met: 10 of 13
87. (drop hoist7 crate6 pallet0 depot0)
   deleted: (lifting hoist7 crate6) (clear pallet0)
   added: (available hoist7) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 10 of 13
88. (drop hoist0 crate1 crate6 depot0)
   deleted: (lifting hoist0 crate1) (clear crate6)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate6)
   goals met: 11 of 13
89. (lift hoist7 crate8 crate14 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist7) (on crate8 crate14)
   added: (lifting hoist7 crate8) (clear crate14)
   goals met: 10 of 13
90. (lift hoist0 crate14 crate3 depot0)
   deleted: (at crate14 depot0) (clear crate14) (available hoist0) (on crate14 crate3)
   added: (lifting hoist0 crate14) (clear crate3)
   goals met: 10 of 13
91. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 10 of 13
92. (load hoist0 crate14 truck0 depot0)
   deleted: (lifting hoist0 crate14)
   added: (in crate14 truck0) (available hoist0)
   goals met: 10 of 13
93. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 10 of 13
94. (unload hoist3 crate14 truck0 distributor0)
   deleted: (in crate14 truck0) (available hoist3)
   added: (lifting hoist3 crate14)
   goals met: 10 of 13
95. (drop hoist3 crate14 pallet3 distributor0)
   deleted: (lifting hoist3 crate14) (clear pallet3)
   added: (available hoist3) (at crate14 distributor0) (clear crate14) (on crate14 pallet3)
   goals met: 11 of 13
96. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 11 of 13
97. (load hoist7 crate8 truck0 depot0)
   deleted: (lifting hoist7 crate8)
   added: (in crate8 truck0) (available hoist7)
   goals met: 11 of 13
98. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 11 of 13
99. (unload hoist3 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist3)
   added: (lifting hoist3 crate8)
   goals met: 11 of 13
100. (drop hoist3 crate8 crate14 distributor0)
   deleted: (lifting hoist3 crate8) (clear crate14)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 crate14)
   goals met: 12 of 13
101. (lift hoist0 crate1 crate6 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate6)
   added: (lifting hoist0 crate1) (clear crate6)
   goals met: 11 of 13
102. (lift hoist7 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist7) (on crate6 pallet0)
   added: (lifting hoist7 crate6) (clear pallet0)
   goals met: 11 of 13
103. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 11 of 13
104. (load hoist7 crate6 truck0 depot0)
   deleted: (lifting hoist7 crate6)
   added: (in crate6 truck0) (available hoist7)
   goals met: 11 of 13
105. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 11 of 13
106. (unload hoist3 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist3)
   added: (lifting hoist3 crate6)
   goals met: 11 of 13
107. (drop hoist3 crate6 crate8 distributor0)
   deleted: (lifting hoist3 crate6) (clear crate8)
   added: (available hoist3) (at crate6 distributor0) (clear crate6) (on crate6 crate8)
   goals met: 12 of 13
108. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 12 of 13
109. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   goals met: 12 of 13
110. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 12 of 13
111. (unload hoist3 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist3)
   added: (lifting hoist3 crate1)
   goals met: 12 of 13
112. (drop hoist3 crate1 crate6 distributor0)
   deleted: (lifting hoist3 crate1) (clear crate6)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 crate6)
   goals met: 13 of 13
